#include "code_demo.h"
#include "types.h"

/*1---------------------------------------------------------------------------------------------------*/

//示例程序1(下面实例会输出您电脑上各种数据类型的大小。)
int main()  
{  
    cout << "type: \t\t" << "************size**************"<< endl;  
    cout << "bool: \t\t" << "所占字节数：" << sizeof(bool);  
    cout << "\t最大值：" << (numeric_limits<bool>::max)();  
    cout << "\t\t最小值：" << (numeric_limits<bool>::min)() << endl;  
    cout << "char: \t\t" << "所占字节数：" << sizeof(char);  
    cout << "\t最大值：" << (numeric_limits<char>::max)();  
    cout << "\t\t最小值：" << (numeric_limits<char>::min)() << endl;  
    cout << "signed char: \t" << "所占字节数：" << sizeof(signed char);  
    cout << "\t最大值：" << (numeric_limits<signed char>::max)();  
    cout << "\t\t最小值：" << (numeric_limits<signed char>::min)() << endl;  
    cout << "unsigned char: \t" << "所占字节数：" << sizeof(unsigned char);  
    cout << "\t最大值：" << (numeric_limits<unsigned char>::max)();  
    cout << "\t\t最小值：" << (numeric_limits<unsigned char>::min)() << endl;  
    cout << "wchar_t: \t" << "所占字节数：" << sizeof(wchar_t);  
    cout << "\t最大值：" << (numeric_limits<wchar_t>::max)();  
    cout << "\t\t最小值：" << (numeric_limits<wchar_t>::min)() << endl;  
    cout << "short: \t\t" << "所占字节数：" << sizeof(short);  
    cout << "\t最大值：" << (numeric_limits<short>::max)();  
    cout << "\t\t最小值：" << (numeric_limits<short>::min)() << endl;  
    cout << "int: \t\t" << "所占字节数：" << sizeof(int);  
    cout << "\t最大值：" << (numeric_limits<int>::max)();  
    cout << "\t最小值：" << (numeric_limits<int>::min)() << endl;  
    cout << "unsigned: \t" << "所占字节数：" << sizeof(unsigned);  
    cout << "\t最大值：" << (numeric_limits<unsigned>::max)();  
    cout << "\t最小值：" << (numeric_limits<unsigned>::min)() << endl;  
    cout << "long: \t\t" << "所占字节数：" << sizeof(long);  
    cout << "\t最大值：" << (numeric_limits<long>::max)();  
    cout << "\t最小值：" << (numeric_limits<long>::min)() << endl;  
    cout << "unsigned long: \t" << "所占字节数：" << sizeof(unsigned long);  
    cout << "\t最大值：" << (numeric_limits<unsigned long>::max)();  
    cout << "\t最小值：" << (numeric_limits<unsigned long>::min)() << endl;  
    cout << "double: \t" << "所占字节数：" << sizeof(double);  
    cout << "\t最大值：" << (numeric_limits<double>::max)();  
    cout << "\t最小值：" << (numeric_limits<double>::min)() << endl;  
    cout << "long double: \t" << "所占字节数：" << sizeof(long double);  
    cout << "\t最大值：" << (numeric_limits<long double>::max)();  
    cout << "\t最小值：" << (numeric_limits<long double>::min)() << endl;  
    cout << "float: \t\t" << "所占字节数：" << sizeof(float);  
    cout << "\t最大值：" << (numeric_limits<float>::max)();  
    cout << "\t最小值：" << (numeric_limits<float>::min)() << endl;  
    cout << "size_t: \t" << "所占字节数：" << sizeof(size_t);  
    cout << "\t最大值：" << (numeric_limits<size_t>::max)();  
    cout << "\t最小值：" << (numeric_limits<size_t>::min)() << endl;  
    cout << "string: \t" << "所占字节数：" << sizeof(string) << endl;  
    // << "\t最大值：" << (numeric_limits<string>::max)() << "\t最小值：" << (numeric_limits<string>::min)() << endl;  
    cout << "type: \t\t" << "************size**************"<< endl;  
    return 0;  
}



/*
type:         ************size**************
bool:              所占字节数：1          最大值：1                          最小值：0
char:              所占字节数：1          最大值：                           最小值：?
signed char:       所占字节数：1          最大值：                           最小值：?
unsigned char:     所占字节数：1          最大值：?                          最小值：
wchar_t:           所占字节数：4          最大值：2147483647                 最小值：-2147483648
short:             所占字节数：2          最大值：32767                      最小值：-32768
int:               所占字节数：4          最大值：2147483647                 最小值：-2147483648
unsigned:          所占字节数：4          最大值：4294967295                 最小值：0
long:              所占字节数：8          最大值：9223372036854775807        最小值：-9223372036854775808
unsigned long:     所占字节数：8          最大值：18446744073709551615       最小值：0
double:            所占字节数：8          最大值：1.79769e+308               最小值：2.22507e-308
long double:       所占字节数：16         最大值：1.18973e+4932              最小值：3.3621e-4932
float:             所占字节数：4          最大值：3.40282e+38                最小值：1.17549e-38
size_t:            所占字节数：8          最大值：18446744073709551615       最小值：0
string:            所占字节数：24
type:         ************size**************
*/
/*1---------------------------------------------------------------------------------------------------*/



/*2---------------------------------------------------------------------------------------------------*/

//2.typedef在大型工程中的好处：
/*
当在不同源文件中用到同一类型数据（尤其是像数组、指针、结构体、共用体等类型数据）时，
常用 typedef 声明一些数据类型，把它们单独放在一个头文件中，然后在需要用到它们的文件中用＃include 
命令把它们包含进来，以提高编程效率。使用 typedef 有利于程序的通用与移植。有时程序会依赖于硬件特性，
用 typedef 便于移植。
*/

/*2---------------------------------------------------------------------------------------------------*/


/*3---------------------------------------------------------------------------------------------------*/

//3.常用数据类型：
int i;                   // 定义一个 int 类型的变量 i
size_t size=sizeof(i);   // 用 sizeof 操作得到变量i的类型的大小
// 这是一个size_t类型的值
// 可以用来对一个size_t类型的变量做初始化

i=(int)size;             // size_t 类型的值可以转化为 int 类型的值
char c='a';              // c 保存了字符 a，占一个字节
wchar_t wc=L'a';         // wc 保存了宽字符 a，占两个字节
// 注意 'a' 表示字符 a，L'a' 表示宽字符 a

int arr[]={1,2,3,4,5};   // 定义一个数组
int *p1=&arr[0];         // 取得数组中元素的地址，赋值给指针
int *p2=&arr[3];
ptrdiff_t diff=p2-p1;    // 指针的减法可以计算两个指针之间相隔的元素个数
// 所得结果是一个 ptrdiff_t 类型

i=(int)diff;             // ptrdiff_t 类型的值可以转化为 int 类型的值

/*3---------------------------------------------------------------------------------------------------*/




/*4---------------------------------------------------------------------------------------------------*/

//4.C++ 中的左值（Lvalues）和右值（Rvalues）
/*
C++ 中有两种类型的表达式：

左值（lvalue）：指向内存位置的表达式被称为左值（lvalue）表达式。左值可以出现在赋值号的左边或右边。
右值（rvalue）：术语右值（rvalue）指的是存储在内存中某些地址的数值。右值是不能对其进行赋值的表达式，
                也就是说，右值可以出现在赋值号的右边，但不能出现在赋值号的左边。
变量是左值，因此可以出现在赋值号的左边。数值型的字面值是右值，因此不能被赋值，不能出现在赋值号的左边。
*/


/*4---------------------------------------------------------------------------------------------------*/




/*5---------------------------------------------------------------------------------------------------*/

//5.定义包含了声明，但是声明不包含定义，如

int a = 0;     //定义并声明了变量 a
extern int a;  //只是声明了有一个变量 a 存在，具体 a 在哪定义的，需要编译器编译的时候去找。

//函数也是类似，定义的时候同时声明。但如果只是声明，编译器只知道有这么个函数，具体函数怎么定义的要编译器去找。

void fun1();  //函数声明

void fun1(){  //函数定义
    cout<<"fun1"<<endl;
}

/*5---------------------------------------------------------------------------------------------------*/







/*6---------------------------------------------------------------------------------------------------*/

/*在程序中，局部变量和全局变量的名称可以相同，但是在函数内，局部变量的值会覆盖全局变量的值*/


//在一个函数体内可以存在重名的变量，前提是它们的作用域不同。
#include <iostream>
using namespace std;

int main()
{
    int b = 2;
    {
        int b = 1;
        cout << "b = " << b << endl;
    }
    cout << "b = " << b << endl;
}
/*输出为：

b = 1
b = 2
当变量间出现重名的情况下，作用域小的屏蔽作用域大的，所以上面第一个 cout 输出 b 的值为 1，
但由于在块里面申请的变量作用域只限于当前块，所以离开这个块后变量会自动释放，
所以第二个 cout 输出 b 的值为 2。
*/


//若要想让 main 函数也使用全局变量 a，可以用 extern 对全局变量进行声明，就可以合法使用了。
#include<iostream>
using namespace std;

int main()
{
     extern int a;
     cout<<"a= "<<a<<endl; //合法，输出10
     return 0;
}
int a=10; //全局变量从此处定义


/*6---------------------------------------------------------------------------------------------------*/





/*7---------------------------------------------------------------------------------------------------*/

//C++常量
/*
以下是各种类型的整数常量的实例：

85         // 十进制
0213       // 八进制 
0x4b       // 十六进制 
30         // 整数 
30u        // 无符号整数 
30l        // 长整数 
30ul       // 无符号长整数


下面列举几个浮点常量的实例：

3.14159       // 合法的 
314159E-5L    // 合法的 
510E          // 非法的：不完整的指数
210f          // 非法的：没有小数或指数
.e55          // 非法的：缺少整数或分数


字符常量:
转义序列	含义
\\	          \ 字符
\'	          ' 字符
\"	          " 字符
\?	          ? 字符
\a	          警报铃声
\b	          退格键
\f	          换页符
\n	          换行符
\r	          回车
\t	          水平制表符
\v	          垂直制表符
\ooo	      一到三位的八进制数
\xhh . . .	  一个或多个数字的十六进制数


定义常量:
在 C++ 中，有两种简单的定义常量的方式：

使用 #define 预处理器。   #define identifier value
                          #define LENGTH 10   
                          #define WIDTH  5
                          #define NEWLINE '\n';

使用 const 关键字。       const type variable = value;
					const int  LENGTH = 10;
					const int  WIDTH  = 5;
					const char NEWLINE = '\n';



宏定义 #define 和常量 const 的区别:
(1).类型和安全检查不同
宏定义是字符替换，没有数据类型的区别，同时这种替换没有类型安全检查，可能产生边际效应等错误；
const常量是常量的声明，有类型区别，需要在编译阶段进行类型检查

(2).编译器处理不同
宏定义是一个"编译时"概念，在预处理阶段展开，不能对宏定义进行调试，生命周期结束与编译时期；
const常量是一个"运行时"概念，在程序运行使用，类似于一个只读行数据

(3).存储方式不同
宏定义是直接替换，不会分配内存，存储与程序的代码段中；
const常量需要进行内存分配，存储与程序的数据段中

(4).定义后能否取消
宏定义可以通过#undef来使之前的宏定义失效
const常量定义后将在定义域内永久有效

void f1()
{
  #define N 12
  const int n = 12;

  #undef N //取消宏定义后，即使在f1函数中，N也无效了
  #define N 21//取消后可以重新定义
}

(5).是否可以做函数参数
宏定义不能作为参数传递给函数
const常量可以在函数的参数列表中出现



1.const 定义常量之后，是不能够改变的

2.宏定义是可以取消的

定义： #define    N    21
取消： #undef    N    12

const限定符定以后是不可以改变的，所以在定义时必须赋初始值，要不然是错误的，除非这个变量是用extern修饰的外部变量。 例如：

const int A=10;       //正确。
const int A;          //错误，没有赋初始值。
extern const int A;   //正确，使用extern的外部变量。




const关键字:
const是constant的简写，只要一个变量前面用const来修饰，就意味着该变量里的数据可以被访问，不能被修改。也就是说const意味着只读（readonly）。
规则：const离谁近，谁就不能被修改；

const修饰一个变量，一定要给这个变量初始化值，若不初始化，后面就无法初始化。
本质：const在谁后面谁就不可以修改，const在最前面则将其后移一位，二者等效。

const关键字作用
为给读你代码的人传达非常有用的信息，声明一个参数为常量是为了告诉用户这个参数的应用目的；
通过给优化器一些附加信息，使关键字const也许能产生更紧凑的代码；
合理使用关键字const可以使编译器很自然的保护那些不希望被修改的参数，防止无意的代码修改，可以减少bug的出现；
const关键字应用

欲阻止一个变量被改变，可使用const，在定义该const变量时，需先初始化，以后就没有机会改变他了；
对指针而言，可以指定指针本身为const，也可以指定指针所指的数据为const，或二者同时指定为const；
在一个函数声明中，const可以修饰形参表明他是一个输入参数，在函数内部不可以改变其值；
对于类的成员函数，有时候必须指定其为const类型，表明其是一个常函数，不能修改类的成员变量；
对于类的成员函数，有时候必须指定其返回值为const类型，以使得其返回值不为“左值”。


*/
/*7---------------------------------------------------------------------------------------------------*/







/*8---------------------------------------------------------------------------------------------------*/
//8.C++ 中的类型限定符
/*
类型限定符提供了变量的额外信息。

限定符	含义
const	const 类型的对象在程序执行期间不能被修改改变。
volatile	修饰符 volatile 告诉编译器，变量的值可能以程序未明确指定的方式被改变。
restrict	由 restrict 修饰的指针是唯一一种访问它所指向的对象的方式。只有 C99 增加了新的类型限定符 restrict。


volatile 往往会用于多线程的修饰，比如：
volatile boolean isNext = false;

Thread A（） {
    // 第一个工作
    // isNext = true;
}

Thread B （）{
    if (isNext) {
        // 第二个工作
    }
}
这里volatile 就是从来标记isNext， 以确保线程B每次都重新从内存中读取isNext的值，第二个工作一定在第一个工作之后进行。
但是要注意，这里无法保证顺序性，应该编译器编译的时候会重新打乱两个语句的先后顺序，因此做第一个工作和赋值给isNext不一定会按照你代码顺序正常执行。

*/



/*
C++提供了关键字explicit，可以阻止不应该允许的经过转换构造函数进行的隐式转换的发生。声明为explicit的构造函数不能在隐式转换中使用。
C++中， 一个参数的构造函数(或者除了第一个参数外其余参数都有默认值的多参构造函数)， 承担了两个角色。 1 是个构造器 ，2 是个默认且隐含的类型转换操作符。
所以， 有时候在我们写下如 AAA = XXX， 这样的代码， 且恰好XXX的类型正好是AAA单参数构造器的参数类型， 这时候编译器就自动调用这个构造器， 创建一个AAA的对象。
这样看起来好象很酷， 很方便。 但在某些情况下（见下面权威的例子）， 却违背了我们（程序员）的本意。 这时候就要在这个构造器前面加上explicit修饰， 指定这个构造器只能被明确的调用/使用， 不能作为类型转换操作符被隐含的使用。

explicit构造函数的作用

解析：

explicit构造函数是用来防止隐式转换的。请看下面的代码：

class Test1
{
public:
    Test1(int n)
    {
        num=n;
    }//普通构造函数
private:
    int num;
};
class Test2
{
public:
    explicit Test2(int n)
    {
        num=n;
    }//explicit(显式)构造函数
private:
    int num;
};
int main()
{
    Test1 t1=12;//隐式调用其构造函数,成功
    Test2 t2=12;//编译错误,不能隐式调用其构造函数
    Test2 t2(12);//显式调用成功
    return 0;
}
Test1的构造函数带一个int型的参数，代码23行会隐式转换成调用Test1的这个构造函数。而Test2的构造函数被声明为explicit（显式），这表示不能通过隐式转换来调用这个构造函数，因此代码24行会出现编译错误。

普通构造函数能够被隐式调用。而explicit构造函数只能被显式调用。

*/


/*
1.静态局部变量有以下特点：
该变量在全局数据区分配内存；
静态局部变量在程序执行到该对象的声明处时被首次初始化，即以后的函数调用不再进行初始化；
静态局部变量一般在声明处初始化，如果没有显式初始化，会被程序自动初始化为0；
它始终驻留在全局数据区，直到程序运行结束。但其作用域为局部作用域，当定义它的函数或语句块结束时，其作用域随之结束；


2.static 修饰类的成员变量
 1). 静态成员变量是先于类的对象而存在
 2). 这个类的所有对象共用一个静态成员
 3). 如果静态成员是公有的，那么可以直接通过类名调用
 4). 静态成员数据在声明时候类外初始化


 3.static 修饰类的成员方法
 1). 静态成员函数是先于类的对象而存在
 2). 可用类名直接调用（公有）
 3). 在静态成员函数中没有this指针，所以不能使用非静态成员

*/


/*8---------------------------------------------------------------------------------------------------*/






/*9---------------------------------------------------------------------------------------------------*/
/*9---------------------------------------------------------------------------------------------------*/







/*10---------------------------------------------------------------------------------------------------*/
/*10---------------------------------------------------------------------------------------------------*/






/*11---------------------------------------------------------------------------------------------------*/
/*11---------------------------------------------------------------------------------------------------*/






/*12---------------------------------------------------------------------------------------------------*/
/*12---------------------------------------------------------------------------------------------------*/






/*13---------------------------------------------------------------------------------------------------*/
/*13---------------------------------------------------------------------------------------------------*/






/*14---------------------------------------------------------------------------------------------------*/
/*14---------------------------------------------------------------------------------------------------*/







/*15---------------------------------------------------------------------------------------------------*/
/*15---------------------------------------------------------------------------------------------------*/






/*16---------------------------------------------------------------------------------------------------*/
/*16---------------------------------------------------------------------------------------------------*/



/*17---------------------------------------------------------------------------------------------------*/
/*17---------------------------------------------------------------------------------------------------*/




/*18---------------------------------------------------------------------------------------------------*/
/*18---------------------------------------------------------------------------------------------------*/




/*19---------------------------------------------------------------------------------------------------*/
/*19---------------------------------------------------------------------------------------------------*/





/*20---------------------------------------------------------------------------------------------------*/
/*20---------------------------------------------------------------------------------------------------*/






/*21---------------------------------------------------------------------------------------------------*/
/*21---------------------------------------------------------------------------------------------------*/






/*22---------------------------------------------------------------------------------------------------*/
/*22---------------------------------------------------------------------------------------------------*/






/*23---------------------------------------------------------------------------------------------------*/
/*23---------------------------------------------------------------------------------------------------*/







/*24---------------------------------------------------------------------------------------------------*/
/*24---------------------------------------------------------------------------------------------------*/






/*25---------------------------------------------------------------------------------------------------*/
/*25---------------------------------------------------------------------------------------------------*/





/*26---------------------------------------------------------------------------------------------------*/
/*26---------------------------------------------------------------------------------------------------*/





/*27---------------------------------------------------------------------------------------------------*/
/*27---------------------------------------------------------------------------------------------------*/





/*28---------------------------------------------------------------------------------------------------*/
/*28---------------------------------------------------------------------------------------------------*/






/*29---------------------------------------------------------------------------------------------------*/
/*29---------------------------------------------------------------------------------------------------*/






/*30---------------------------------------------------------------------------------------------------*/
/*30---------------------------------------------------------------------------------------------------*/





/*31---------------------------------------------------------------------------------------------------*/
/*31---------------------------------------------------------------------------------------------------*/






/*32---------------------------------------------------------------------------------------------------*/
/*32---------------------------------------------------------------------------------------------------*/






/*33---------------------------------------------------------------------------------------------------*/
/*33---------------------------------------------------------------------------------------------------*/





/*34---------------------------------------------------------------------------------------------------*/
/*34---------------------------------------------------------------------------------------------------*/





/*35---------------------------------------------------------------------------------------------------*/
/*35---------------------------------------------------------------------------------------------------*/





/*36---------------------------------------------------------------------------------------------------*/
/*36---------------------------------------------------------------------------------------------------*/





/*37---------------------------------------------------------------------------------------------------*/
/*37---------------------------------------------------------------------------------------------------*/














































